powerfull/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоПоступлениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоПродажамТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоПродажамУслугИАбонементов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тренер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Администратор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Директор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

powerfull/src/InformationRegisters/ИсторияЗаписей/ИсторияЗаписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияЗаписей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тренер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

powerfull/src/InformationRegisters/ДопДанныеОСотрудниках/ДопДанныеОСотрудниках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДопДанныеОСотрудниках</name>
  <attributes>
    <name>СерияПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПаспорта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачиПаспорта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыданПаспорт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Гражданство</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

powerfull/src/InformationRegisters/КвалификацияСотрудников/КвалификацияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КвалификацияСотрудников</name>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпытРаботы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыдавшийОрган</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКвалификации</name>
    <type>
      <types>EnumRef.ТипыКвалификаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

powerfull/src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьПользователяИБ(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты) 
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторПользователяИБ)
		Или ВходРазрешен Тогда
		
		Если ПустаяСтрока(Логин) Тогда
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Необходимо заполнить логин";
			Сообщение.Поле = "Логин";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПользователяИБ(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		ПользовательИБСоздан = Истина;
	Иначе
		ПользовательИБСоздан = Ложь;
	КонецЕсли;
	
	Если НЕ ПользовательИБСоздан И НЕ ВходРазрешен Тогда;
		Возврат;
	КонецЕсли;
	
	Если НЕ ПользовательИБСоздан Тогда;
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	Иначе
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
        	ТекущийОбъект.ИдентификаторПользователяИБ);
			
		КонецЕсли;
		
	ПользовательИБ.ПолноеИмя = ТекущийОбъект.Наименование;
	ПользовательИБ.Имя = Логин;
	ПользовательИБ.АутентификацияСтандартная = ВходРазрешен;
	
	Если ПарольИзменен Тогда
		ПользовательИБ.Пароль = Пароль;
	КонецЕсли;	
	
	ЗаполнитьРолиПользователяИБ(ТекущийОбъект, ПользовательИБ);
		
	ПользовательИБ.Записать();
	
	ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРолиПользователяИБ(ТекущийОбъект, ПользовательИБ)
	
	ПользовательИБ.Роли.Очистить();
	
	Если ТекущийОбъект.Администратор Тогда;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
	КонецЕсли;
	
	Если ТекущийОбъект.МенеджерПоПоступлениям Тогда;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.МенеджерПоПоступлениям);
	КонецЕсли;
			
	Если ТекущийОбъект.МенеджерПоПродажамТоваров Тогда;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.МенеджерПоПродажамТоваров);
	КонецЕсли;
	
	Если ТекущийОбъект.МенеджерПоПродажамУслугИАбонементов Тогда;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.МенеджерПоПродажамУслугиИАбонементов);
	КонецЕсли;
	
	Если ТекущийОбъект.Тренер Тогда;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Тренер);
	КонецЕсли;
	
	Если ТекущийОбъект.Директор Тогда;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Директор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
        	ТекущийОбъект.ИдентификаторПользователяИБ);
			
		ВходРазрешен = ПользовательИБ.АутентификацияСтандартная;
		Логин = ПользовательИБ.Имя;
		
		Если ЗначениеЗаполнено(ПользовательИБ.СохраняемоеЗначениеПароля) Тогда
			Пароль = Новый УникальныйИдентификатор;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	ПарольИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияЗаписей(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОткрываемойФормы = "РегистрСведений.ИсторияЗаписей.ФормаСписка";
	СтруктураОтбора = Новый Структура("Тренер", Объект.Ссылка);
	СтруктураПараметров = Новый Структура("Отбор", СтруктураОтбора); 
	ОткрытьФорму(ИмяОткрываемойФормы,СтруктураПараметров,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

&НаКлиенте
Процедура ДопДанные(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОткрываемойФормы = "РегистрСведений.ДопДанныеОСотрудниках.ФормаСписка";
	СтруктураОтбора = Новый Структура("Сотрудник", Объект.Ссылка);
	СтруктураПараметров = Новый Структура("Отбор", СтруктураОтбора); 
	ОткрытьФорму(ИмяОткрываемойФормы,СтруктураПараметров,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

&НаКлиенте
Процедура Квалификация(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОткрываемойФормы = "РегистрСведений.КвалификацияСотрудников.ФормаСписка";
	СтруктураОтбора = Новый Структура("Сотрудник", Объект.Ссылка);
	СтруктураПараметров = Новый Структура("Отбор", СтруктураОтбора); 
	ОткрытьФорму(ИмяОткрываемойФормы,СтруктураПараметров,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры
